app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", "Justin Bieber"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = ? LIMIT 1  [["name", "Tik Tok"]]
INSERT INTO "artists" ("name", "genre", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ajsdasdas"], ["genre", "Pop"], ["age", 23], ["created_at", "2016-01-26 18:52:39.736485"], ["updated_at", "2016-01-26 18:52:39.736485"]]
INSERT INTO "songs" ("name", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hello"], ["artist_id", 1], ["created_at", "2016-02-11 00:16:41.329357"], ["updated_at", "2016-02-11 00:16:41.329357"]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 15], ["updated_at", "2016-02-11 00:17:13.906997"], ["id", 10]]
---
  def create

    @artist = Artist.find_or_initialize_by(name: artist_params[:name])
    if !artist_params[:song_attributes][:name].empty?
      song = Song.find_or_initialize_by(name: artist_params[:song_attributes][:name])
      @artist.songs << song
    end

    respond_to do |format|
    if @artist.is_valid?
        @artist.save

UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "JUSTIN BIEBER"], ["updated_at", "2016-01-13 17:25:20.583897"], ["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = ? LIMIT 1  [["name", "Justin bieber"]]
UPDATE "songs" SET "name" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "Justin bieber"], ["updated_at", "2016-02-17 03:03:34.105374"], ["id", 25]]
---
  def update
    respond_to do |format|
      if @artist.update(name: artist_params[:name].titleize)

        @artist.songs.each do |song|
          song.artist.update(name: @artist.name.titleize)

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 5]]
---
  def destroy
    # @songs = Song.all.find_by(:artist_id => @artist.id)
    # @songs.destroy
    @artist.destroy

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_artist
      @artist = Artist.find(params[:id])