app/controllers/songs_controller.rb

  def all
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def new
    @song = Song.new
    @song.artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 25]]

  def create
    artist = Artist.find_or_create_by(id: params[:artist_id])
    @song = Song.new(name: song_params[:name])
    @song.artist = artist
    respond_to do |format|

      if @song.is_valid?
        @song.save
        artist.songs.append @song
        format.html { redirect_to artist_songs_path(artist.id), notice: 'Song was successfully created.' }
        format.json { render action: 'show', status: :created, location: @song }
      else
        @song.artist.destroy
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "HAIM"], ["created_at", "2016-01-10 21:14:39.237942"], ["updated_at", "2016-01-10 21:14:39.237942"]]
SELECT  "artists".* FROM "artists" WHERE (Justin Bieber) LIMIT 1
INSERT INTO "songs" ("name", "artist_id", "length", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Love Yourself"], ["artist_id", 1], ["length", "3:21"], ["genre", "Pop"], ["created_at", "2016-01-26 18:42:49.851565"], ["updated_at", "2016-01-26 18:42:49.851565"]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 35]]

  def update
    respond_to do |format|
      if @song.update(name: song_params[:name].titleize)
---
UPDATE "songs" SET "name" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "Hands to myself"], ["updated_at", "2016-02-11 01:05:42.672815"], ["id", 24]]

  def destroy
    @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 2]]

    def set_song
      @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]